Tekla Open API Reference for Tekla Structures 2025
ConicalSurfaceNode Methods
The ConicalSurfaceNode type exposes the following members.
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern.
 (Overrides BendSurfaceNode.AcceptVisitor(IGeometryNodeVisitor).)
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides BendSurfaceNode.Clone().)
Top
See Also
Reference
ConicalSurfaceNode Class
Tekla.Structures.Model Namespace